; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 spectrograph2)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet19)
	(supports instrument7 spectrograph2)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon17)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite1 Star7)
	(pointing satellite3 Star14)
	(pointing satellite4 Planet19)
	(have_image Star5 spectrograph1)
	(have_image Star7 thermograph0)
	(have_image Planet8 thermograph0)
	(have_image Planet9 spectrograph1)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 spectrograph1)
	(have_image Planet12 thermograph0)
	(have_image Star13 thermograph0)
	(have_image Star14 spectrograph2)
	(have_image Star15 spectrograph2)
	(have_image Planet16 spectrograph1)
	(have_image Phenomenon17 spectrograph2)
	(have_image Star18 spectrograph1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 17
2. (turn_to satellite4 groundstation2 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 groundstation2)
   goals met: 0 of 17
3. (calibrate satellite4 instrument7 groundstation2)
   added: (calibrated instrument7)
   goals met: 0 of 17
4. (turn_to satellite4 phenomenon10 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 17
5. (take_image satellite4 phenomenon10 instrument7 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 1 of 17
6. (turn_to satellite4 phenomenon17 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon17)
   goals met: 1 of 17
7. (take_image satellite4 phenomenon17 instrument7 spectrograph2)
   added: (have_image phenomenon17 spectrograph2)
   goals met: 2 of 17
8. (turn_to satellite4 planet12 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 planet12)
   goals met: 2 of 17
9. (take_image satellite4 planet12 instrument7 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 3 of 17
10. (turn_to satellite4 planet16 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet16)
   goals met: 3 of 17
11. (take_image satellite4 planet16 instrument7 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 4 of 17
12. (turn_to satellite4 planet19 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet19)
   goals met: 5 of 17
13. (turn_to satellite3 star14 planet19)
   deleted: (pointing satellite3 planet19)
   added: (pointing satellite3 star14)
   goals met: 6 of 17
14. (turn_to satellite1 star7 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star7)
   goals met: 7 of 17
15. (turn_to satellite0 groundstation4 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 groundstation4)
   goals met: 8 of 17
16. (turn_to satellite4 planet8 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet8)
   goals met: 7 of 17
17. (take_image satellite4 planet8 instrument7 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 8 of 17
18. (turn_to satellite4 planet19 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet19)
   goals met: 9 of 17
19. (turn_to satellite4 planet9 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet9)
   goals met: 8 of 17
20. (take_image satellite4 planet9 instrument7 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 9 of 17
21. (turn_to satellite4 planet19 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 planet19)
   goals met: 10 of 17
22. (turn_to satellite4 star11 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star11)
   goals met: 9 of 17
23. (take_image satellite4 star11 instrument7 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 10 of 17
24. (turn_to satellite4 planet19 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 planet19)
   goals met: 11 of 17
25. (turn_to satellite4 star13 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star13)
   goals met: 10 of 17
26. (take_image satellite4 star13 instrument7 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 11 of 17
27. (turn_to satellite4 planet19 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 planet19)
   goals met: 12 of 17
28. (turn_to satellite4 star14 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star14)
   goals met: 11 of 17
29. (take_image satellite4 star14 instrument7 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 12 of 17
30. (turn_to satellite4 planet19 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 planet19)
   goals met: 13 of 17
31. (turn_to satellite4 star15 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star15)
   goals met: 12 of 17
32. (take_image satellite4 star15 instrument7 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 13 of 17
33. (turn_to satellite4 planet19 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 planet19)
   goals met: 14 of 17
34. (turn_to satellite4 star18 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star18)
   goals met: 13 of 17
35. (take_image satellite4 star18 instrument7 spectrograph1)
   added: (have_image star18 spectrograph1)
   goals met: 14 of 17
36. (turn_to satellite4 planet19 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 planet19)
   goals met: 15 of 17
37. (turn_to satellite4 star5 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star5)
   goals met: 14 of 17
38. (take_image satellite4 star5 instrument7 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 15 of 17
39. (turn_to satellite4 planet19 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 planet19)
   goals met: 16 of 17
40. (turn_to satellite4 star7 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 star7)
   goals met: 15 of 17
41. (take_image satellite4 star7 instrument7 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 16 of 17
42. (turn_to satellite4 planet19 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 planet19)
   goals met: 17 of 17
